{
  "full-name" : "John Allsopp",
  "image" : "speakers/john.png",
  "image-credit" : "Drew McLellan",
  "talk-title" : "HTML5",
  "talk-description" : "HTML5 is much more than a bunch of new semantic markup. In this full day workshop, John Allsopp takes you beyond the header and footer, to focus on some of the powerful, but surprisingly easy to use, features of the next generation of HTML (and related W3C technologies): UI features, offline capabilities, rich media, geolocation, accelerometers, and many more hidden gems.\n\nJohn will also focus on important universal access issues like backwards compatibility, accessibility, device and browser support, to ensure your sites and apps work across the widest range of devices for as many people as possible.\n\nJust bring a laptop and the tools you use every day to work with HTML/CSS/JavaScript!",
  "talk-audience" : "This workshop is for anyone who is ready to start building apps using web technologies. The core focus is the features of HTML5, particularly DOM APIs, and what they enable, not JavaScript. So, if you are comfortable with CSS and HTML, you will be fine with this workshop.\n\nHowever, we will cover aspects of the DOM, and there’ll be a little bit of JavaScript involved, but there’s no need to be a Ninja!",
  "learn" : [
    {
      "topic" : "In-depth Hands On",
      "desc" : "Key aspects of building web apps"
    },{
      "topic" : "New Form Elements",
      "desc" : "Attributes and APIs for creating rich HTML5 application interfaces"
    },{
      "topic" : "Offline HTML5",
      "desc" : "Store data during and between sessions"
    },{
      "topic" : "Audio & Video",
      "desc" : "Native and fallback playback"
    },{
      "topic" : "Geolocaton",
      "desc" : "Locate and track your users"
    },{
      "topic" : "Device Motion",
      "desc" : "Accessing the accelerometer and gyroscope"
    },{
      "topic" : "",
      "desc" : ""
    }
  ],
  "details" : [{
      "date" : "9th & 10th November 2012",
      "time" : "09:30 to 17:00",
      "teacher" : "John Allsopp",
      "teaher-url" : "http://twitter.com/johnallsopp",
      "venue" : "The Lighthouse",
      "venue-url" : "#",
      "price" : "£345",
      "ticket": true,
      "vat" : true
  }]
}